app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Naya David"], ["updated_at", "2020-01-17 12:02:49.394346"], ["id", 4]]
---
    def update
      @student = Student.find(params[:id])
      @student.update(student_params(:first_name, :last_name))